Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Core concepts in the main programme area are polynomials and polynomial division, linear equations, series and convergence.
nb: Sentrale begreper i hovedområdet er polynomer og polynomdivisjon, lineære likningssystemer, rekker og konvergens.

source: give a presentation of the Norwegian Church, Læstadianism and Sami church life
nb: gjøre rede for sjamanens plass i de fortidige samiske samfunnene, beskrive trommen og bruken av den

source: explain the difference between a budget and a financial statement for operation and investment in an aquaculture business, and highlight any disparities and the possible reasons for these disparities
nb: forklare forskjellen mellom et budsjett og et regnskap for drift og investering i en akvakulturvirksomhet, og påvise eventuelle avvik og mulige årsaker til dem

source: give an account of the concepts of distribution and stochastic variables for finite probabilities, and find expectation, variance and standard deviation for a stochastic variable
nb: gjøre rede for begrepene fordeling og stokastisk variabel for endelige utfallsrom, og finne forventning, varians og standardavvik for en stokastisk variabel

source: elaborate on and discuss the relationship between resources and economic activity and show how this can lead to social change
nb: drøfte sammenhenger mellom ressurser og økonomisk aktivitet og vise hvordan dette kan føre til samfunnsendringer

source: This includes students at risk of dropping out of school.
nb: Kohorter er kun aktuelt på gult og rødt nivå.

source: explain how buffer solutions function, and calculate pH and capacity in buffers
nb: forklare hvordan buffere virker, og beregne pH og kapasitet i buffere

source: in Geosciences involves gathering, registering and preparing information, and presenting results with digital means.
nb: i geofag innebærer å innhente, registrere og bearbeide informasjon og presentere resultater digitalt.

source: The development of reading skills in mathematics refers to finding and using information in increasingly complex texts with advanced symbolic language and concepts.
nb: Utviklingen av leseferdigheter i matematikk handler om å finne og bruke informasjon i stadig mer komplekse tekster med avansert symbolspråk og begrepsbruk.

source: ‘This may be a bit difficult for employees or parents to hear, but this is the children’s subjective view of their experiences’, says Sandseter.
nb: – Dette kan være litt sårt for ansatte eller foreldre å høre, men dette er barnas stemme og deres opplevelser, sier Sandseter.

source: describe the situation for some indigenous peoples in English-speaking countries
nb: beskrive situasjonen til noen urfolk i engelskspråklige land

source: talk about philosophy, religion and philosophy of life as a basis for ethical thinking, and be able to discuss and elaborate on moral role models from the past and present
nb: samtale om filosofi, religion og livssyn som grunnlag for etisk tenkning og kunne drøfte noen moralske forbilder fra fortid og nåtid

source: The Renaissance and explanation
nb: Medvirkning og medbestemmelse

source: Initially, Annica Löfdahl Hultman and her colleagues intended to focus on what is documented when preschools engage in quality assurance work.
nb: I utgangspunktet skulle Annica Löfdahl Hultman og hennes kolleger se på hva som blir dokumentert når barnehagene driver sitt kvalitetsarbeid.

source: describe the phases of social science research and assess methodological and ethical issues in research
nb: beskrive fasene i samfunnsvitenskapelig forskning og vurdere metodiske og etiske problemstillinger knyttet til forskningen

source: It also involves being able to discuss and evaluate professional solutions and working processes.
nb: I tillegg vil det si å kunne diskutere og vurdere faglige løsninger og arbeidsprosesser.

source: The employee looks at him and says he has to ask the girls if he might taste the cakes.
nb: Den ansatte ser på Jarek og sier at han må spørre jentene om han kan få smake på kakene deres.

source: in Landscaper and Sports Facilities Operator studies involves reporting and documenting clearly to clients and cooperation partners.
nb: i anleggsgartner- og idrettsanleggsfag innebærer å rapportere og dokumentere og formulere seg tydelig overfor oppdragsgivere og samarbeidspartnere.

source: On average, boys score 8 points more than the girls on the scale standardised to 500 with a standard deviation of 100. But this is too small to be statistically significant.
nb: I gjennomsnitt får guttene 8 poeng høyere enn jentene på skalaen som er standardisert til 500 og har et standardavvik på 100, men dette er for lite til å være statistisk signifikant.

source: They must not use these devices as part of unstructured play, but rather be cognisant of the methods that can be used to achieve a goal.
nb: De må ikke bruke dette som en del av det frie lekematerialet, men tenke på hvilke metoder som kan brukes for å nå et mål.

source: elaborate on why some countries are poor and some rich, and discuss measures to reduce poverty in the world
nb: gjøre rede for årsaker til at noen land er fattige og noen rike og drøfte tiltak for å redusere fattigdom i verden

source: About 71 per cent of the kindergarten teachers believed that the special education teachers were primarily intended to help meet the needs of the individual child.
nb: 71 prosent av barnehagelærerne mente at spesialpedagogene først og fremst skal rette hjelpen mot det enkelte barns behov.

source: The relationships between Norwegian language, Sign Language and the status of minority languages also form part of this main subject area.
nb: dreier seg om tegnspråkets formverk, innhold og status, og om hvordan språket og språkbruken har endret seg over tid.

source: compare some aspects of the way of living, traditions and customs in Norway and English-speaking countries
nb: samtale om noen sider ved ulike levesett, tradisjoner og skikker i engelskspråklige land og i Norge

source: develop and use well-reasoned strategies for subtracting in practical
nb: utvikle og bruke hensiktsmessige strategier for subtraksjon i praktiske

source: give an account of a research project in a company or institution, and describe problems, organization, measuring equipment, results and financing of this
nb: gjøre rede for et forskningsprosjekt i en bedrift eller institusjon, og beskrive problemstillinger, organisering, måleutstyr, resultater og finansiering

source: assess and revise their own texts based on technical criteria
nb: bruke datateknologien til å arkivere og systematisere egne tekster

source: The pupils should develop an independent understanding of Norwegian language and literature and gain an insight into how language and text have evolved and continue to evolve over time.
nb: Hovedområdet dreier seg om norsk språk og litteratur, og av hvordan språk og litteratur har endret seg over tid og fortsatt er i endring.

source: Social science has competence aims after the second year of upper secondary school (VG 2) within the vocational education programmes and in education programmes for sports and music, dance and drama.
nb: I yrkesfaglige utdanningsprogram og i utdanningsprogram for idrettsfag og musikk, dans og drama har samfunnsfag kompetansemål etter Vg2.

source: This article is not based on research on the NB-ECEC database like the other articles in this magazine.
nb: Denne artikkelen bygger ikke på forskning i databasen NB-ECEC, slik som øvrige artikler i magasinet gjør.

source: It involves taking simple measurements of physical and chemical parameters, setting up and interpreting tables, diagrams and basic statistics.
nb: Det innebærer også å foreta enkle målinger av fysiske og kjemiske parametere, sette opp og tolke tabeller, diagrammer og enkel statistikk.

source: recognise and use linguistic devices such as repetition, contrast and simple figurative language
nb: gjenkjenne og bruke de språklige virkemidlene gjentakelse, kontrast og enkle språklige bilder

source: The education shall help to develop the sense of social belongingness and mastering of various roles in society, working life and leisure activities.
nb: Opplæringen skal bidra til utvikling av sosial tilhørighet og mestring av ulike rol er i samfunns­ og arbeidslivet og i fritiden.

source: Competence aims after 1T - Vg1 education programmes for general studies
nb: Kompetansemål etter1T – Vg1 studieførebuande utdanningsprogram

source: The study involved 45 ECEC employees from the five Nordic countries reading an anecdotal story about a real-life episode observed by researchers in a Swedish preschool.
nb: I studien fikk de 45 barnehageansatte fra de fem nordiske landene lese historien om en virkelig hendelse som ble observert av forskere i en svensk barnehage.

source: Showing due consideration for copyright and privacy protection is a key element in the use of digital tools.
nb: Å ta hensyn til opphavsrett og personvern er en del av det å bruke digitale verktøy.

source: ‘Regrettably, that doesn’t always happen’, says Svinth.
nb: Men det er dessverre ikke alltid slik, mener Svinth.

source: analyse the content and evaluate the use of devices in texts taken from different digital media
nb: analysere innhold og vurdere bruk av virkemidler i tekster som er hentet fra ulike digitale medier

source: analyze different mathematical models for a physical situation, with and without digital tools, and assess which model best describes the situation
nb: analysere ulike matematiske modeller for en fysisk situasjon, med og uten digitale verktøy, og vurdere hvilken modell som beskriver situasjonen best

source: explain what redox reactions are, carry out experiments with combustion, galvanic elements and electrolysis and elaborate on the results
nb: forklare hva redoksreaksjoner er, gjøre forsøk med forbrenning, galvanisk element og elektrolyse og gjøre greie for resultatene

source: English literature and culture: 140 teaching hours per year Basic skills
nb: Engelskspråklig litteratur og kultur: 140 årstimer Grunnleggende ferdigheter

source: Involvement and collaboration
nb: Redusert kontakt mellom personer.

source: Keeping schools open is particularly important.
nb: Det å holde skolene åpne er spesielt viktig.

source: The teacher and pupils shall engage in dialogue about their development in Social Studies.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i samfunnsfag.

source: Parents and teachers generally agreed.
nb: Foreldre og barnehagelærere er i stor grad enige.

source: how data and personal data can be used or misused
nb: hvordan data og personopplysninger kan brukes eller misbrukes

source: Mathematics X builds on mathematics 1T and is organized especially for Vg2 pupils who opt for mathematics R1.
nb: Matematikk X bygger på matematikk 1T og er spesielt beregnet for elever på Vg2 som velger matematikk R1.

source: Dynamic processes are studied, such as mirroring, rotation and displacement.
nb: Man studerer dynamiske prosesser som speiling, rotasjon og forskyvning.

source: It includes communicating with others and producing, composing and editing texts.
nb: Det omfatter kommunikasjon med andre og å produsere, komponere og redigere tekster.

source: It follows from the premise for special Norwegian instruction that the curriculum for basic Norwegian for language minorities is a transitional plan, shall be used only until pupils are able to follow the teaching in accordance with the regular curriculum in Norwegian.
nb: Det følger av premissene for den særskilte norskopplæringen at læreplanen i grunnleggende norsk for språklige minoriteter er en overgangsplan som bare skal nyttes til elevene er i stand til å følge opplæring etter den ordinære læreplanen i norsk.

source: It also deals with how a society consists of different text cultures with dissimilar tasks, such as informing, politics, the governing of society, religion, art and entertainment.
nb: Det dreier seg om hvordan et samfunn består av ulike tekstkulturer med ulike oppgaver, som opplysning, politikk, samfunnsstyring, religion, kunst og underholdning.

source: explore mathematical properties and relationships by means of
nb: utforske matematiske egenskaper og sammenhenger ved å bruke

source: the connections between structure and function
nb: sammenhenger mellom oppbygning og funksjon

source: part of the national project
nb: del av det nasjonale prosjektet

source: English texts, films, music and other art forms may also inspire the pupil's own artistic expression and creativity in many genres and media.
nb: Engelske tekster, film, musikk og andre kunstformer kan videre inspirere til elevens egen utfoldelse og kreativitet i flere sjangere og medier.

source: It just means that we think we can offer other options in kindergarten as well’, comments Häll.
nb: Men vi synes vi kan tilby noe annet i barnehagen, sier Häll.

source: The municipalities were spread all over Sweden.
nb: Kommunene var fordelt over hele Sverige.

source: made into part of day to day teaching and learning in the
nb: ring til en del av den daglege læringa og undervisninga

source: They were ready to share experiences.
nb: De var klare for felles opplevelser.

source: give an account of political institutions in Norway and compare them with institutions in other countries
nb: gjøre rede for politiske institusjoner i Norge og Sápmi/Sábme/Saepmie og rollefordelingen mellom de politiske institusjonene

source: Yet they have no ‘recipe’ for what constitutes Sámi culture.
nb: Men de mangler en oppskrift på hva samisk kultur er.

source: similarity and congruence
nb: formlikhet og kongruens

source: register feed amounts, mortality, average weight, density and environmental parameters
nb: utføre registreringer av fôrmengde, dødelighet, snittvekt, tetthet og miljøparametere

source: Representations in mathematics T are ways of expressing mathematical concepts, relationships and problems.
nb: Elevene skal kunne ta utgangspunkt i en idé og videreutvikle den gjennom ulike prosesser som planlegging, design og gjennomføring.

source: read and understand texts of varying lengths and in various genres
nb: lese og forstå tekster av ulik lengde og i ulike sjangere

source: describe the temple, reflect on its significance and use, and use digital tools to search for information and make presentations about this
nb: beskrive tempelet og reflektere over dets betydning og bruk og nytte digitale verktøy til å søke informasjon og lage presentasjoner

source: For centuries, Britain and the United States occupied a key position in world society, both politically and culturally.
nb: Storbritannia og USA har i århundrer hatt en sentral posisjon i verdenssamfunnet, både politisk og kulturelt.

source: ‘The fact that many like being in kindergarten is, of course, wonderful.
nb: – Det at mange trives godt i barnehagen, er jo kjempebra.

source: use different strategies to calculate area and circumference, and
nb: bruke ulike strategier for å regne ut areal og omkrets og utforske

source: One of the preschools she studied was a so-called sports preschool, while the other two were conventional facilities.
nb: En av barnehagene hun har studert, er en såkalt idrettsbarnehage, de to andre er tradisjonelle barnehager.

source: The teacher shall have conversations with the pupil regarding their development in art and crafts.
nb: Læreren og elevene skal være i dialog om elevenes utvikling i kunst og håndverk.

source: Abbreviated information on young people with chronic diseases and conditions.
nb: Informasjon om ungdom med kroniske sykdommer og tilstander er forkortet.

source: Assessment as learning
nb: Vurdering som læring

source: The subject should stimulate the pupils' desire to read and write, and it should help them develop good learning strategies.
nb: Tegnspråkfaget skal være grunnleggende fag for læring og kunnskapstilegnelse, og er et sentralt fag for kommunikasjon, kulturforståelse, kommunikasjon, dannelse og identitetsutvikling.

source: use various media to interpret and present texts from various epochs
nb: sammenligne samiske eventyr med andre urfolks eventyr og eventyr fra andre kulturer

source: explain and use technical words and concepts
nb: forklare og bruke faglige ord og begreper

source: practice in all lower and secondary education and training.
nb: er en som har inngått opplæringskontrakt med sikte på en mindre omfattende

source: The main subject area Production and labour concerns production in different cultures and eras, as well as the significance of work for the individual and for society.
nb: handler om produksjon i ulike kulturer og tidsepoker og om arbeidets betydning for individ og samfunn.

source: Variant T is more theoretical, while Variant P is more practical.
nb: T-varianten er mer teoretisk orientert, mens P-varianten er mer praktisk orientert.

source: work with powers, formulae, brackets and rational and quadratic expressions with numerals and letters
nb: regne med potenser, formler, parentesuttrykk og rasjonale og kvadratiske uttrykk med tall og bokstaver

source: spend more than 80 per cent of their time with the children.
nb: bruker i overkant av 80 PROSENT av tiden sammen med barna.

source: They observed and filmed situations of the leaders talking with their co-workers.
nb: De har observert og filmet situasjoner der lederen har snakket med sine medarbeidere.

source: They wanted to work there as teachers, to be the person they were, not to play football or carpentry.
nb: De ville jobbe i barnehagen for å være barnehagelærere, som den personen de er, ikke for å spille fotball eller snekre.

source: experiment with different Sign Language devices and varieties of style
nb: eksperimentere med ulike tegnspråklige virkemidler og stilvarianter

source: use a scale to calculate distances and prepare and converse about maps and work drawings, with and without using digital tools
nb: bruke målestokk til å beregne avstander og lage og samtale om kart og arbeidstegninger, med og uten digitale verktøy

source: The significance of the capital market for the economy is a central theme in the subject.
nb: Kapitalmarkedenes betydning for økonomien står sentralt i dette hovedområdet.

source: Linguistic, textual, literary and aesthetic theories and methods as tools for interpretation, analysis and assessment are all covered by the main subject area.
nb: Språk- og tekstvitenskapelige, litterære og estetiske teorier og metoder som redskap for tolkning, analyse og vurdering inngår i hovedområdet.

source: choose and use tools, machines and equipment according to relevant regulations and standards
nb: velge og bruke aktuelt verktøy, aktuelle redskaper, maskiner og utstyr etter gjeldende regelverk og standarder

source: describe and assess one's own reading and writing strategies
nb: beskrive og vurdere egne lese-og skrivestrategier

source: explain the terms change per unit and average speed
nb: begrepene endring per enhet og gjennomsnittsfart

source: The programme subjects shall develop an understanding of the market and provide an insight into the industry’s role in society and role as an international food producer.
nb: Programfagene skal utvikle markedsforståelse og gi innsikt i næringens rolle i samfunnet og rolle som internasjonal matprodusent.

source: use the correct tools and equipment based on the situation, the equipment’s construction and mode of operation
nb: bruke riktig redskap og utstyr ut fra situasjon, utstyrets oppbygning og virkemåte

source: observe and note what happens with a tree or another perennial plant over time
nb: observere og notere hva som skjer med et tre eller en annen flerårig plante over tid

source: in religion and ethics means being able to listen and formulate ideas in conversations and dialogues.
nb: i religion og etikk innebærer å lytte og formulere seg gjennom samtaler og dialog.

source: plan and carry out experiments and evaluate risk, sources of error and results
nb: planlegge og gjennomføre forsøk og vurdere risiko, feilkilder og resultater

source: analyse sociogeographical conditions in Sámi settlement areas
nb: analysere samfunnsgeografiske forhold i samiske bosettingsområder

source: Then Anna comes over and sits down beside him.
nb: Så kommer Anna og setter seg ned ved siden av ham.

source: The social science subject addresses the interdisciplinary topic of democracy and citizenship by increasing the pupils’ critical awareness of the society they belong to.
nb: Utviklingen av muntlige ferdigheter i mat og helse går fra å samtale om matlaging og måltider til å presentere og diskutere stadig mer komplekse temaer om helse, matforbruk og matsikkerhet.

source: “It must be room enough.
nb: – Det må være nok plass.

source: In addition, 18 children from one to three years old were observed.
nb: I tillegg ble 18 barn mellom ett og tre år observert.

source: Contact your kindergarten for more information.
nb: For mer informasjon kontakt barnehagen din.

source: converse about love and respect, variations of sexual orientation, married life and family, and discuss the consequences of a lack of respect for our differences
nb: samtale om kjærlighet og respekt, variasjon i seksuell orientering, samliv og familie og diskutere konsekvenser av manglende respekt for ulikheter

source: When play-acting, however, the children did not fight to hold onto the same positions.
nb: Når det lages drama, kjempet de ikke om de samme posisjonene.

source: The quality framework summarises and elaborates on the provisions in the Education Act and its regulations, including the National Curriculum, and must be considered in light of the legislation and regulations.
nb: Prinsipper for opplæringen sammenfatter og utdyper bestemmelser i opp­læringsloven, forskrift til loven, herunder læreplanverket for opplæringen, og må ses i lys av det samlede regelverket.

source: discuss, elaborate on and asses fiction based on personal experiences and with understanding of language and content
nb: diskutere hvordan språk kan uttrykke og skape holdninger til enkeltindivider og grupper av mennesker

source: That is a doll’s pram!’
nb: Dette er jo en dukkevogn!»

source: describe the interaction between aesthetic devices in composite texts and reflect on how we are influenced by sound, language and images
nb: beskrive samspillet mellom estetiske virkemidler i sammensatte tekster og reflektere over hvordan vi påvirkes av lyd, språk og bilder

source: The study was carried out at 43 preschools in Denmark.
nb: Studien er gjort i 43 barnehager i Danmark.

source: discuss how social scientists can be influenced by their cultural background, and elaborate on and discuss the challenge of maintaining objectivity in social research
nb: diskutere hvordan samfunnsforskeren kan påvirkes av kulturbakgrunn og drøfte utfordringer i forbindelse med objektivitet i samfunnsforskning

source: That facilitates systematic efforts.
nb: Det skaper systematikk i arbeidet.

source: conduct planned presentations by means of role play, drama, recitation or interview
nb: gjennomføre planlagte presentasjoner gjennom rollespill, drama, opplesning og intervju

source: in one’s mother tongue means, for most minority language pupils, being able to crack the reading code in the language they know the best and have the most experience listening to.
nb: i morsmål innebærer for de fleste minoritetsspråklige elever å knekke lesekoden på det språket de behersker best og har flest erfaringer knyttet til.

source: Planning and documentation
nb: Planlegging og dokumentasjon

source: give an account of the interaction between linguistic and non-linguistic forms of expression in a variety of communicative processes
nb: gjøre rede for samspillet mellom språklige og ikke-språklige uttrykksformer i ulike kommunikasjonsprosesser
